const data = {
    user: {
        first_name: 'Захар',
        second_name: 'Петров',
        login: 'gandalfbirthdaycake',
        display_name: 'gandalf',
        email: 'gandalfbeer@aol.com',
        password: null,
        phone: '+79118503923',
        avatar: new URL('/static/img/test_avatar2.jpg', import.meta.url).href,
        id: 1
    },
    chats: [
        {
            id: 2,
            display_name: 'Кузьмин Арсений',
            avatar: new URL('/static/img/test_avatar.jpg', import.meta.url).href,
            active: true,
            last_message: {
                time: 'Mon',
                preview: 'Соображения выполнять реализации плановых рост позволяет административных...',
                unread: 0,
            },
            messages: [
                {
                    text:'Соображения выполнять реализации плановых рост позволяет административных организации, и играет соображения соображения позиций',
                    timestamp: 1650170901,
                    unread: true
                },
                {
                    text:'Дальнейших активизации. Условий способствует заданий повседневная дальнейших оценить особенности',
                    timestamp: 1650170961,
                    unread: true
                },

            ]
        },
        {
            id: 3,
            display_name: 'Руднева Николь',
            avatar: new URL('/static/img/test_avatar3.jpg', import.meta.url).href,
            last_message: {
                time: '14:55',
                preview: 'Позиций, выполнять структура в собой структура 🤓',
                unread: 2,
            },
            messages: [
                {
                    text:'Реализации эксперимент представляет представляет оценить участниками роль направлений повседневная подготовки.',
                    timestamp: 1650171081,
                    unread: false
                },
                {
                    text:'Позиций, выполнять структура в собой структура количественный важные сфера рол.',
                    timestamp: 1650171201,
                    unread: false
                },

            ]
        },
        {
            id: 4,
            display_name: 'Lois Brown',
            avatar: new URL('/static/img/test_avatar1.jpg', import.meta.url).href,
            last_message: {
                time: 'Sun',
                preview: 'Повседневная практика показывает, что социально-экономическое развитие...',
                unread: 0,
            },
            messages: [
                {
                    text:'Реализации эксперимент представляет представляет оценить участниками роль направлений повседневная подготовки.',
                    timestamp: 1650171081,
                    unread: false
                },
                {
                    text:'Позиций, выполнять структура в собой структура количественный важные сфера рол.',
                    timestamp: 1650171201,
                    unread: false
                },

            ]
        },
    ],
    active_chat: {
        id: 2,
        display_name: 'Кузьмин Арсений',
        avatar: new URL('/static/img/test_avatar.jpg', import.meta.url).href,
        last_message: {
            time: 'Mon',
            preview: 'Соображения выполнять реализации плановых рост позволяет административных...',
            unread: 0,
        },
        messages: [
            {
                sender: {
                    id: 2,
                    display_name: 'Кузьмин Арсений',
                    avatar: new URL('/static/img/test_avatar.jpg', import.meta.url).href,
                },
                text:'ЧД растут за счет поглощения малоплотных образований (планеты, газовые звезды, туманности) а так же за счет очень плотных карликовых звезд. Если же сблизятся высокоплотные тела (ЧД, кварковые и нейтронные звезды), то дальнейшее развитие будет зависеть от соотношения масс этих тел. Если разница не очень большая то, как было описано в предыдущей статье, образуется квазар с выбросом джетов. Если же разница будет большая, то образуется квазар без джетов, т.к. режим разуплотнения наступит только у меньшего тела и все извергаемое им вещество будет перебрасываться на более массивное тело. Излучение же, образующееся при разуплотнении, многократно увеличит яркость ядра материнской галактики. Такие объекты астрономы называют галактиками с активным ядром.',
                timestamp: 1650060971,
            },
            {
                sender: {
                    id: 2,
                    display_name: 'Кузьмин Арсений',
                    avatar: new URL('/static/img/test_avatar.jpg', import.meta.url).href,
                },
                text:'Завершая, следует сказать и о экспериментах, проведенных в лаборатории "Протон 21"😍🤪',
                timestamp: 1650170801,
            },
            {
                sender: {
                    id: 1,
                    display_name: 'gandalf',
                    avatar: new URL('/static/img/test_avatar2.jpg', import.meta.url).href,
                },
                text:'Соображения высшего порядка, а также рамки и место обучения кадров играет важную роль в формировании дальнейших направлений развитая системы массового участия. Практический опыт показывает, что социально-экономическое развитие требует от нас системного анализа модели развития. С другой стороны сложившаяся структура организации требует от нас системного анализа ключевых компонентов планируемого обновления.',
                timestamp: 1650170901,
            },
            {
                sender: {
                    id: 1,
                    display_name: 'gandalf',
                    avatar: new URL('/static/img/test_avatar2.jpg', import.meta.url).href,
                },
                text:'Не следует, однако, забывать о том, что рамки и место обучения кадров создаёт предпосылки качественно новых шагов для системы обучения кадров, соответствующей насущным потребностям.',
                timestamp: 1650170961,
            },
            {
                sender: {
                    id: 2,
                    display_name: 'Кузьмин Арсений',
                    avatar: new URL('/static/img/test_avatar.jpg', import.meta.url).href,
                },
                text:'Соображения выполнять реализации плановых рост позволяет административных организации, и играет соображения соображения позиций',
                timestamp: 1650170971,
            },
            {
                sender: {
                    id: 2,
                    display_name: 'Кузьмин Арсений',
                    avatar: new URL('/static/img/test_avatar.jpg', import.meta.url).href,
                },
                text:'Дальнейших активизации. Условий способствует заданий повседневная дальнейших оценить особенности',
                timestamp: 1650171961,
            },
            {
                sender: {
                    id: 1,
                    display_name: 'gandalf',
                    avatar: new URL('/static/img/test_avatar2.jpg', import.meta.url).href,
                },
                text:'Статус: отправлено',
                timestamp: 1650172081,
                status: 'sent',
            },
            {
                sender: {
                    id: 1,
                    display_name: 'gandalf',
                    avatar: new URL('/static/img/test_avatar2.jpg', import.meta.url).href,
                },
                text:'Статус: доставлено',
                timestamp: 1650173081,
                status: 'delivered',
            },
            {
                sender: {
                    id: 2,
                    display_name: 'Кузьмин Арсений',
                    avatar: new URL('/static/img/test_avatar.jpg', import.meta.url).href,
                },
                text:'Статус: непрочитано',
                timestamp: 1650174081,
                status: 'unread'
            },
            {
                sender: {
                    id: 2,
                    display_name: 'Кузьмин Арсений',
                    avatar: new URL('/static/img/test_avatar.jpg', import.meta.url).href,
                },
                text:'Статус: прочитано',
                timestamp: 1650175081,
                status: 'read'
            },
            {
                sender: {
                    id: 2,
                    display_name: 'Кузьмин Арсений',
                    avatar: new URL('/static/img/test_avatar.jpg', import.meta.url).href,
                },
                text:'картинка с подписью',
                img_attachment: new URL('/static/img/jimmy-jin-rtbC1SOwMZ4-unsplash.jpg', import.meta.url).href,
                timestamp: 1650175981,
                status: 'read'
            },
        ]
    }
};

export {data};